---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData
source: html/5c3c90a6-699d-b6cf-44f7-405986d13073.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData

Represents the data and parameters of analytical zone equipment.

## Syntax (C#)
```csharp
public class ZoneEquipmentData : IDisposable
```